ahtn/keyplus/efm8/efm8/mcu/C8051F320/inc/SI_C8051F320_Register_Enums.h
#define REF0CN_REFSL__BMASK    0x08 ///< Voltage Reference Select                          
#define REF0CN_REFSL__SHIFT    0x03 ///< Voltage Reference Select                          
#define REF0CN_REFSL__VREF     0x00 ///< Use the VREF pin as the voltage reference.        
#define REF0CN_REFSL__VDD      0x08 ///< Use VDD as the voltage reference.                 
                                                                                           
//------------------------------------------------------------------------------
// REG0CN Enums (Voltage Regulator Control @ 0xC9)
//------------------------------------------------------------------------------
#define REG0CN_REG0MD__BMASK     0x10 ///< VREG0 Voltage Regulator Mode                     
#define REG0CN_REG0MD__SHIFT     0x04 ///< VREG0 Voltage Regulator Mode                     
#define REG0CN_REG0MD__NORMAL    0x00 ///< VREG0 Voltage Regulator in normal mode.          
#define REG0CN_REG0MD__LOW_POWER 0x10 ///< VREG0 Voltage Regulator in low power mode.       
                                                                                            
#define REG0CN_VBPOL__BMASK      0x20 ///< VBUS Interrupt Polarity Select                   
#define REG0CN_VBPOL__SHIFT      0x05 ///< VBUS Interrupt Polarity Select                   
#define REG0CN_VBPOL__LOW        0x00 ///< VBUS interrupt active when VBUS is low.          
#define REG0CN_VBPOL__HIGH       0x20 ///< VBUS interrupt active when VBUS is high.         
                                                                                            
#define REG0CN_VBSTAT__BMASK     0x40 ///< VBUS Signal Status                               
#define REG0CN_VBSTAT__SHIFT     0x06 ///< VBUS Signal Status                               
#define REG0CN_VBSTAT__NOT_SET   0x00 ///< VBUS signal currently absent (device not attached
                                      ///< to USB network).                                 
#define REG0CN_VBSTAT__SET       0x40 ///< VBUS signal currently present (device attached to
                                      ///< USB network).                                    
                                                                                            
#define REG0CN_REG0DIS__BMASK    0x80 ///< Voltage Regulator (REG0) Disable                 
#define REG0CN_REG0DIS__SHIFT    0x07 ///< Voltage Regulator (REG0) Disable                 
#define REG0CN_REG0DIS__ENABLED  0x00 ///< Enable the VREG0 Voltage Regulator.              
#define REG0CN_REG0DIS__DISABLED 0x80 ///< Disable the VREG0 Voltage Regulator.             
                                                                                            
//------------------------------------------------------------------------------
// EMI0CN Enums (External Memory Interface Control @ 0xAA)
//------------------------------------------------------------------------------
#define EMI0CN_PGSEL__FMASK 0x07 ///< XRAM Page Select
#define EMI0CN_PGSEL__SHIFT 0x00 ///< XRAM Page Select
                                                      
#endif // SI_C8051F320_REGISTER_ENUMS_H
//-eof--------------------------------------------------------------------------

